app/Controllers/Reserve.php

    public function create($bookId, $days)
    {

        $reserveModel= new ReserveModel();
        $bookId=$this->request ->getPost('bookId');
        $days=$this->request ->getPost('days');

        $userId=session()->get('username');

        //Reserve data
        $data=['days' => $days,
                'user_id' =>$userId
        ];

        $reserveModel->insert($data);
---
INSERT INTO `reserve` (`days`, `user_id`) VALUES ('7', 'prueba')